{"meta":{"title":"Zhi-Qiang Zhou blog","subtitle":"Life is Good.","description":"Machine Learnig, Optimization, Fluid Mechacnis, Tsinghua, Beijing","author":"Zhi-Qiang Zhou","url":"http://yoursite.com"},"pages":[{"title":"Categories","date":"2018-01-17T05:41:25.423Z","updated":"2018-01-17T05:41:25.383Z","comments":false,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":"","raw":null,"content":null},{"title":"About","date":"2018-01-17T05:11:01.364Z","updated":"2018-01-17T05:11:01.284Z","comments":false,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"Zhi-Qiang ZhouPh.D candidateDepartment of Engineering MechanicsTsinghua Universityemail: zzq_890709@hotmail.com / zhouzq14(at)mails.tsinghua.edu.cn","raw":null,"content":null},{"title":"Tags","date":"2018-01-17T05:41:10.779Z","updated":"2018-01-17T05:41:10.751Z","comments":false,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":"","raw":null,"content":null}],"posts":[{"title":"Hello World","slug":"hello-world","date":"2018-01-17T04:36:19.827Z","updated":"2016-09-14T11:29:08.000Z","comments":true,"path":"2018/01/17/hello-world/","link":"","permalink":"http://yoursite.com/2018/01/17/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","raw":null,"content":null,"categories":[],"tags":[]},{"title":"ODE And PDE","slug":"ode-pde","date":"2016-09-21T06:17:25.000Z","updated":"2018-01-17T05:13:57.198Z","comments":true,"path":"2016/09/21/ode-pde/","link":"","permalink":"http://yoursite.com/2016/09/21/ode-pde/","excerpt":"","text":"ODEs involve one or more functions of a single variable, with all derivatives ordinary ones relative to that variable. PDEs allow functions of several variables and partial derivatives of the unknown functions with respect to those variables. Here’s an ODE: $$m \\frac{d^2 x}{d t^2} + k x=0$$ Here $x$ is an unknown function of $t$ and $m$,$k$ are constants. That’s a second-order, linear, ordinary differential equation. Another example is the following system of equations in the unknown functions $y,z$ of the variable $x$ . $$y’’’+(y z’)^2 - 12 x=0$$$$z’’ + 7 y’’x^5 = \\cos x$$ Here $u$ is an unknown function of 3 variables $x,y,t$ describing the temperature on a two-dimensional surface as a function of time. The equation governs how heat dissipates and redistributes itself over time along the surface. To your second question, “Is there a way to visualise these differential equations?”, the answer is that there are many ways to visualize various ODEs and PDEs but none that I can point out in that generality. What are “these” in this sentence? Pretty much all differential equations are either ODEs and PDEs so this is like asking “is there a way to visualize all differential equations”. Here’s another way to think of it. An ODE describes a particle moving through time (you can graph it on two axes: space and time). Even if you have a finite system of N equations, that can be thought of as N particles in 1-dimensional space or alternatively, just 1 particle in N-dimensional space. This is why the “initial condition” is just one point. On the other hand, a PDE describes a surface changing over time. In 1 space dimension and 1 time dimension, this would just be a curve changing over time. To visualize it physically, think of the oscillation of a guitar string that’s just been plucked (wave equation). In this case, $u(t,x)$ is the displacement of the string at time $t$ and position on the string $x$ . Whereas the solution to an ODE is a finite-dimensional vector, the solution to a PDE is a function. This is why the “initial conditions” for PDE are functions defined at all space positions at time 0. A diff eqn is an eqn contaning derivatives of a dependent variable wrt one and more independent variablethen it has two types1) ODE (Ordinary diff eqn) This type of diff eqn contaning single independent variablei.e the derivative occcures in an eqn are ordinary2) PDE (Partial diff eqn) This type of diff eqn contaning two or more independent variablei.e the derivative occcures in an eqn are partial","raw":null,"content":null,"categories":[],"tags":[{"name":"abc","slug":"abc","permalink":"http://yoursite.com/tags/abc/"}]},{"title":"ouchyang","slug":"ouchyang","date":"2016-09-21T06:17:25.000Z","updated":"2016-09-21T06:43:08.000Z","comments":true,"path":"2016/09/21/ouchyang/","link":"","permalink":"http://yoursite.com/2016/09/21/ouchyang/","excerpt":"","text":"$$\\frac{\\partial u}{\\partial t}= h^2 \\left( \\frac{\\partial^2 u}{\\partial x^2} +\\frac{\\partial^2 u}{\\partial y^2} +\\frac{\\partial^2 u}{\\partial z^2}\\right)$$","raw":null,"content":null,"categories":[],"tags":[]}]}